# Getting Started with pandas

1. Review를 위한 단계
- 방식 : chapter05 장을 보면서 이해하고 주석 달기
- 제출 방식 : 강사가 제시한 폴더에 파일명 수정해서 제출하기
- 파일명 : **step03_bookReview임동원.ipynb**

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Introduction to pandas Data Structures

### Series

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
#index값 모두 보여주는 문법
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
#해당 index에 대응되는 Series값 출력하기
obj2['a']

-5

In [8]:
obj2['d'] = 6

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
#obj2>0을 하면, b,c,d index에 해당하는 값이 True, a index에 해당하는 값이 False가 출력된다.
#따라서 True에 해당되는 값들 만 출력되게된다
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
# exponential함수를 취한 값들이다. 즉 e^(6)=403.428793..이므로 index d에 해당하는 값은 다음과같이 출력된다.
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
#해당 index가 있으면 True, 없으면 False
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
#딕셔너리를 이용한 Series만들기
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
obj3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [18]:
#pd.Series(sdata)를통해 sdata를 이용하여 Series를 만드는 문법임을 알 수 있다.
#index=states이므로 states에 있는 값들은 해당 딕셔너리 value값들이 출력되고 그렇지 않은 경우엔 Nan값이 출력됨을 알 수 있다.
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
#pd.isnull()함수의 파라미터에 Series를 넣으면 해당 Series가 비어있으면 True, 그렇지 않은 경우 False를 출력한다.
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
#pd.isnull(ㅁㅁㅁㅁ) 대신 ㅁㅁㅁㅁ.isnull()를 써도된다 
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj3
obj4
obj3 + obj4
#Series끼리 더하는 경우 같은 index값끼리 더하고, 한쪽이라도 index가 없으면 해당 index값은 NaN으로 출력된다

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj4.name = 'population'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [27]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [28]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
#DataFrame을 딕셔너리 안에 리스트를 넣어 만든경우이다
#리스트르 안에 딕셔너리를 넣거나, 리스트안에 리스트를 넣어서 DataFrame을 만들 수 도 있다

In [8]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [9]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [10]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [11]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [18]:
frame2=pd.DataFrame(data, columns=['year', 'state', 'pop','dept'])

In [19]:
frame2.columns

Index(['year', 'state', 'pop', 'dept'], dtype='object')

In [20]:
#DataFrame['열이름'] 혹은 DataFrame.열이름 으로 Series를 출력 할 수 있다.
frame2['state']
print(frame2['state'])
print(type(frame2['state']))

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
<class 'pandas.core.series.Series'>

In [21]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [22]:
frame2

   year   state  pop dept
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [24]:
frame2=pd.DataFrame(data, columns=['year', 'state', 'pop','dept'],index=['one','two','three','four','five','six'])

In [25]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
dept      NaN
Name: three, dtype: object

In [26]:
frame2['debt'] = 16.5
frame2

       year   state  pop dept  debt
one    2000    Ohio  1.5  NaN  16.5
two    2001    Ohio  1.7  NaN  16.5
three  2002    Ohio  3.6  NaN  16.5
four   2001  Nevada  2.4  NaN  16.5
five   2002  Nevada  2.9  NaN  16.5
six    2003  Nevada  3.2  NaN  16.5

In [27]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop dept  debt
one    2000    Ohio  1.5  NaN   0.0
two    2001    Ohio  1.7  NaN   1.0
three  2002    Ohio  3.6  NaN   2.0
four   2001  Nevada  2.4  NaN   3.0
five   2002  Nevada  2.9  NaN   4.0
six    2003  Nevada  3.2  NaN   5.0

In [28]:
#DataFrame의 특정 열 특정 값을 바꾸는 문법
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop dept  debt
one    2000    Ohio  1.5  NaN   NaN
two    2001    Ohio  1.7  NaN  -1.2
three  2002    Ohio  3.6  NaN   NaN
four   2001  Nevada  2.4  NaN  -1.5
five   2002  Nevada  2.9  NaN  -1.7
six    2003  Nevada  3.2  NaN   NaN

In [43]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [44]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [29]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [33]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [31]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [32]:
# 전치행렬인 T를 사용해도 기존 행렬의 구조가 변화하진 않는다
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [50]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [51]:
pd.DataFrame(pop)#, index=[2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [52]:
pd

In [53]:
!pip show pandas

Name: pandas
Version: 0.23.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: python-dateutil, pytz, numpy
Required-by: seaborn, odo

In [34]:
pd.DataFrame(pop, index=pd.Int64Index([2001, 2000, 2002]))

      Nevada  Ohio
2001     2.4   1.7
2000     NaN   1.5
2002     2.9   3.6

In [35]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [36]:
#frame3['ohio'] 는 frame3의 ohio열에 해당하는 Series를 불러오고, 이떄 다시 인덱싱을 하면 해당 series의 원소들을 가져온다
frame3['ohio'][:]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [57]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [58]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [59]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [60]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [61]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [62]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [63]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [64]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [65]:
index[1:]

Index(['b', 'c'], dtype='object')

index[1] = 'd'  # TypeError

In [66]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [67]:
#index=labels를 사용하면 Series의 길이에 맞게 0부터 1씩 증가한 숫자가 하나씩 대응된다
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [68]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [69]:
obj2.index is labels

True

In [70]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [71]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [72]:
'Ohio' in frame3.columns

True

In [73]:
2003 in frame3.index

False

In [74]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [75]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [76]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [37]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [40]:
#method='ffill'을 사용하면 기존 index값까지, 해당하는 원소들이 채워져서 출력된다
obj3.reindex(range(10), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
8    yellow
9    yellow
dtype: object

In [79]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [80]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [81]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [82]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

In [83]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [84]:
#Series에서 Series.drop('index이름')을 하면 해당 index의 성분이 없어진 Series가 출력된다
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [85]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [86]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
#DataFrame에서 열 혹은 행을 삭제하고싶을때, DataFrame.drop(행또는 열이름 ,axis=?? )을 사용하면 깔끔하다
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [90]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [92]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [93]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [41]:
#arange(4)는 정수 array, arange(4.)은 실수 array력한다
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [42]:
print(type(obj['b']))
print(type(obj[['b']]))

<class 'numpy.float64'>
<class 'pandas.core.series.Series'>

In [96]:
obj[1]

1.0

In [97]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [98]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [99]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [100]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [101]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [102]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [103]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [43]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [106]:
#대게 DataFrame에서 2개 이상의 열을 가져올때 DataFrame['열이름']에서 '열이름'자리에 열이름 리스트를 쓴다
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [107]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [108]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
#DataFrmae에 boolean값을 주면 모든 원소가 해당 조건을 만족하는지따져서 모든 원소의 True False값을 출력하게된다
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [111]:
data[data < 5] = 0

In [112]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

In [113]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [114]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [115]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
#data.iloc[2]는 해당 행에 대한 정보를 출력한다
print(data.iloc[2])
print(type(data.iloc[2]))

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32
<class 'pandas.core.series.Series'>

In [117]:
#data.iloc[2]는 4개의 값을 가진 Series이다. 따라서 이 4개의 값중 3,0,1번째 index에 해당하는 값들을 차례로 출력하게된다
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [118]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [119]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [120]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [121]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

ser = pd.Series(np.arange(3.))
ser
ser[-1]

In [122]:
ser = pd.Series(np.arange(3.))

In [123]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [124]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [125]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [126]:
ser2[-1]

2.0

In [127]:
ser[:1]

0    0.0
dtype: float64

In [128]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [129]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [130]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [131]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [132]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [133]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [134]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
# columns=list('bde')를 하면 index_column이 b,d,e에 해당하는 열들을 모두 선택한다

In [135]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [136]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [137]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [138]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [139]:
df1

   A
0  1
1  2

In [140]:
df2

   B
0  3
1  4

In [141]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [142]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [143]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [144]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [145]:
df2.loc[1, 'b'] = np.nan

In [146]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [147]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [148]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [149]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [150]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [151]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [152]:
#0인 값은 DataFrame에서 역수를 취하면 inf, 즉 무한대가 된다
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [153]:
#위 표현과 똑같은 표현이다
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [154]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [155]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [156]:
arr[0]

array([0., 1., 2., 3.])

In [157]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [158]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [159]:
series = frame.iloc[0]

In [160]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [161]:
#frame에서 series를 뺴주면 shape를 맞춰 준 후 빼기가 진행된다
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [162]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [163]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [164]:
series2

b    0
e    1
f    2
dtype: int64

In [165]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [166]:
series3 = frame['d']

In [167]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [168]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [169]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [170]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [46]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.167240 -1.412791 -0.926247
Ohio    0.886646 -1.104881  0.988118
Texas  -0.018835  0.702215  0.571374
Oregon -1.145291  0.232345 -0.430240

In [47]:
np.abs(frame)

               b         d         e
Utah    0.167240  1.412791  0.926247
Ohio    0.886646  1.104881  0.988118
Texas   0.018835  0.702215  0.571374
Oregon  1.145291  0.232345  0.430240

In [48]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.031937
d    2.115006
e    1.914365
dtype: float64

In [49]:
frame.apply(f, axis='columns')

Utah      1.580031
Ohio      2.092998
Texas     0.721051
Oregon    1.377636
dtype: float64

In [50]:
#위와 똒같은 코드
frame.apply(f, axis=1)

Utah      1.580031
Ohio      2.092998
Texas     0.721051
Oregon    1.377636
dtype: float64

In [176]:
frame

               b         d         e
Utah   -0.705584  2.353987  1.630998
Ohio    0.041649  0.302744  0.398901
Texas  -1.050203  0.654161  0.307664
Oregon  0.547241  0.109169 -0.659533

In [177]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.050203  0.109169 -0.659533
max  0.547241  2.353987  1.630998

In [178]:
#함수는 하나의 값을 처리하고, 처리대상은 DataFrame이므로 applymap을 사용하였다
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.71  2.35   1.63
Ohio     0.04  0.30   0.40
Texas   -1.05  0.65   0.31
Oregon   0.55  0.11  -0.66

In [179]:
frame['e'].map(format)

Utah       1.63
Ohio       0.40
Texas      0.31
Oregon    -0.66
Name: e, dtype: object

### Sorting and Ranking

In [180]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [181]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [182]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [183]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [184]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [185]:
# sort_index하면 말그대로 index가 정렬된다. 문자는 a~z순으로, 숫자는 작은값~큰값이다.
# default값은 axis=0이고, 설정해서 바꿀수 있다
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [186]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [187]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [188]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [189]:
obj = pd.Series([4, 7, -3, 2])

In [190]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [191]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [192]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [193]:
#Series의 원소들을 기준으로 정렬하기 = sort_values()
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [194]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [195]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [196]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [197]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [53]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4,4,4,4,4])
obj

0     7
1    -5
2     7
3     4
4     2
5     0
6     4
7     4
8     4
9     4
10    4
dtype: int64

In [54]:
#값들을 기준으로 순위를 매긴다. 단 값이 같은 경우 평균 순위를 매긴다
obj.rank()

0     10.5
1      1.0
2     10.5
3      6.5
4      3.0
5      2.0
6      6.5
7      6.5
8      6.5
9      6.5
10     6.5
dtype: float64

In [200]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [201]:
#method=max를 하면 같은 값을 가지는 그룹을 높은 순위로 매긴다
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [202]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [203]:
#DataFrame에도 rank를 사용할 수 있는데, 이때는 어떤 축을 기준으로 순위를 매길 것인가를 axis=?로 설정해줘야한다.
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [204]:
frame.rank('columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [205]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
#obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [206]:
obj.index.is_unique

False

In [207]:
obj['a']

a    0
a    1
dtype: int64

In [208]:
obj['c']

4

In [209]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -2.043267 -0.289882 -0.108089
a -0.275251 -0.554052  1.185572
b -0.921949 -0.068770 -2.405088
b -1.305323 -2.050683  0.512519

In [210]:
df.loc['b']

          0         1         2
b -0.921949 -0.068770 -2.405088
b -1.305323 -2.050683  0.512519

## Summarizing and Computing Descriptive Statistics

In [211]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [212]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [213]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [214]:
#nul값을 무시하지 않는 것으로 하나라도 nul이라면 해당 계산은 NaN이 출력된다
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [215]:
df.mean(axis='columns', skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [216]:
df.idxmax()

one    b
two    d
dtype: object

In [217]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [218]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [219]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [220]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [221]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Unique Values, Value Counts, and Membership

In [222]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [223]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [224]:
# Series.value_counts를 하면 중복된 값이 각각 몇개씩 있는지를 출력한다.
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [225]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [226]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [227]:
#Series.isin을 사용하면 해당 성분인 Series만 True, 아닌 값들은 False가 출력된다.
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [228]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [229]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [230]:
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [231]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [232]:
unique_vals

0    c
1    b
2    a
dtype: object

In [233]:
#unique_vals의 index를보면 0일때 c, 1일때 b, 2일때 a이다. 이를 통해 to_match의 데이터에 해당 값을 대입하여 새로운 array를 만드는 문법이다.
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [234]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [235]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 누락된 데이터 처리하기

1. 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 빈번한 작업
- 모든 기술 통계는 누락된 데이터를 배제하고 처리
- 처리 방법 1 : 수집된 데이터를 직접 제거
- 처리 방법 2 : dropna 함수 사용하여 처리

In [60]:
from numpy import nan as NA

Series의 NA값 제거해 보기

In [237]:
data = Series([1, NA, 3.5, NA, 7])

In [238]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [239]:
#Series에서 빈값을 drop하는 문법
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [240]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [241]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

DataFrame의 NA값 제거하기

In [242]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [243]:
#DataFrame에서 dropno()를 사용하면 빈값이 하나라도 있는 index 행은 모두 제거된 후 출력된다.
#원본 데이터가 손상되지는 않는다.
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [244]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [245]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [246]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [247]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [55]:
df = DataFrame(np.random.randn(7, 3))

In [56]:
df

          0         1         2
0 -1.255034  1.053866 -0.251744
1 -3.485662 -0.377066 -0.819572
2  0.030991  0.536545  0.807480
3 -0.169650 -0.642529  0.562179
4 -1.315416 -0.850008  1.138232
5 -0.670382 -0.509106 -0.151550
6 -1.726256  1.475210 -1.221039

In [61]:
df.loc[:4, 1] = NA

In [62]:
df

          0         1         2
0 -1.255034       NaN -0.251744
1 -3.485662       NaN -0.819572
2  0.030991       NaN  0.807480
3 -0.169650       NaN  0.562179
4 -1.315416       NaN  1.138232
5 -0.670382 -0.509106 -0.151550
6 -1.726256  1.475210 -1.221039

In [63]:
df.loc[:2, 2] = NA
df

          0         1         2
0 -1.255034       NaN       NaN
1 -3.485662       NaN       NaN
2  0.030991       NaN       NaN
3 -0.169650       NaN  0.562179
4 -1.315416       NaN  1.138232
5 -0.670382 -0.509106 -0.151550
6 -1.726256  1.475210 -1.221039

In [64]:
#데이터가 3개는 필요하다. 즉, 데이터가 3개가 안되는 행은 drop한다는 문법
df.dropna(thresh=3)

          0         1         2
5 -0.670382 -0.509106 -0.151550
6 -1.726256  1.475210 -1.221039

In [65]:
df

          0         1         2
0 -1.255034       NaN       NaN
1 -3.485662       NaN       NaN
2  0.030991       NaN       NaN
3 -0.169650       NaN  0.562179
4 -1.315416       NaN  1.138232
5 -0.670382 -0.509106 -0.151550
6 -1.726256  1.475210 -1.221039

In [66]:
df.dropna(thresh=2, axis=0)

          0         1         2
3 -0.169650       NaN  0.562179
4 -1.315416       NaN  1.138232
5 -0.670382 -0.509106 -0.151550
6 -1.726256  1.475210 -1.221039

In [67]:
df

          0         1         2
0 -1.255034       NaN       NaN
1 -3.485662       NaN       NaN
2  0.030991       NaN       NaN
3 -0.169650       NaN  0.562179
4 -1.315416       NaN  1.138232
5 -0.670382 -0.509106 -0.151550
6 -1.726256  1.475210 -1.221039

In [68]:
df.dropna(thresh=5, axis=1)

          0
0 -1.255034
1 -3.485662
2  0.030991
3 -0.169650
4 -1.315416
5 -0.670382
6 -1.726256

In [258]:
df.dropna(thresh=3, axis=1)

          0         2
0 -2.195191       NaN
1  1.789237       NaN
2  0.461074       NaN
3  0.909237  0.776739
4  0.211165  1.156295
5  0.630160 -0.396120
6 -2.298666 -2.366954

누락된 값 채우기

In [259]:
df

          0         1         2
0 -2.195191       NaN       NaN
1  1.789237       NaN       NaN
2  0.461074       NaN       NaN
3  0.909237       NaN  0.776739
4  0.211165       NaN  1.156295
5  0.630160 -1.122891 -0.396120
6 -2.298666 -1.974549 -2.366954

In [260]:
#DataFrame의 모든 빈값을 파라미터값으로 채운다는 문법
df.fillna(0)

          0         1         2
0 -2.195191  0.000000  0.000000
1  1.789237  0.000000  0.000000
2  0.461074  0.000000  0.000000
3  0.909237  0.000000  0.776739
4  0.211165  0.000000  1.156295
5  0.630160 -1.122891 -0.396120
6 -2.298666 -1.974549 -2.366954

In [261]:
df

          0         1         2
0 -2.195191       NaN       NaN
1  1.789237       NaN       NaN
2  0.461074       NaN       NaN
3  0.909237       NaN  0.776739
4  0.211165       NaN  1.156295
5  0.630160 -1.122891 -0.396120
6 -2.298666 -1.974549 -2.366954

In [262]:
df.fillna({1:0.5, 3:-1})

          0         1         2
0 -2.195191  0.500000       NaN
1  1.789237  0.500000       NaN
2  0.461074  0.500000       NaN
3  0.909237  0.500000  0.776739
4  0.211165  0.500000  1.156295
5  0.630160 -1.122891 -0.396120
6 -2.298666 -1.974549 -2.366954

In [263]:
df

          0         1         2
0 -2.195191       NaN       NaN
1  1.789237       NaN       NaN
2  0.461074       NaN       NaN
3  0.909237       NaN  0.776739
4  0.211165       NaN  1.156295
5  0.630160 -1.122891 -0.396120
6 -2.298666 -1.974549 -2.366954

In [264]:
df.fillna({2:10})

          0         1          2
0 -2.195191       NaN  10.000000
1  1.789237       NaN  10.000000
2  0.461074       NaN  10.000000
3  0.909237       NaN   0.776739
4  0.211165       NaN   1.156295
5  0.630160 -1.122891  -0.396120
6 -2.298666 -1.974549  -2.366954

In [265]:
df

          0         1         2
0 -2.195191       NaN       NaN
1  1.789237       NaN       NaN
2  0.461074       NaN       NaN
3  0.909237       NaN  0.776739
4  0.211165       NaN  1.156295
5  0.630160 -1.122891 -0.396120
6 -2.298666 -1.974549 -2.366954

## 계층적 색인

1. pandas의 중요한 기능
- 축에 대해 다중(2개 이상) 색인 단계 지정 가능(MultiIndex)
- 고차원 데이터를 낮은 차원의 형식으로 다룰수 있게 해주는 기능

In [266]:
data = Series(np.random.randn(10), 
              index=[
                      ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
                      [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]
              ])

In [267]:
data

a  1    0.725068
   2   -0.990273
   3    0.013685
b  1   -0.473149
   2   -2.089740
   3    0.488818
c  1   -0.473395
   2    1.517124
d  2    0.877102
   3   -0.476883
dtype: float64

In [268]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [269]:
data.values

array([ 0.7250678 , -0.9902733 ,  0.01368467, -0.47314882, -2.08974018,
        0.48881812, -0.47339518,  1.51712437,  0.87710185, -0.47688264])

계층적으로 색인된 객체는 데이터의 부분 집합을 부분적 색인으로 접근이 가능

In [270]:
data['b']

1   -0.473149
2   -2.089740
3    0.488818
dtype: float64

In [271]:
data['b':'c']

b  1   -0.473149
   2   -2.089740
   3    0.488818
c  1   -0.473395
   2    1.517124
dtype: float64

In [272]:
data.loc[['b', 'c']]

b  1   -0.473149
   2   -2.089740
   3    0.488818
c  1   -0.473395
   2    1.517124
dtype: float64

In [273]:
data

a  1    0.725068
   2   -0.990273
   3    0.013685
b  1   -0.473149
   2   -2.089740
   3    0.488818
c  1   -0.473395
   2    1.517124
d  2    0.877102
   3   -0.476883
dtype: float64

하위 계층의 객체 선택

In [274]:
data[:, 2]

a   -0.990273
b   -2.089740
c    1.517124
d    0.877102
dtype: float64

계층적인 색인은 데이터를 재형성 가능

In [275]:
# 계층색인을 푼 새로운 DataFrame형성
#원본 데이터 손상 x
data.unstack()

          1         2         3
a  0.725068 -0.990273  0.013685
b -0.473149 -2.089740  0.488818
c -0.473395  1.517124       NaN
d       NaN  0.877102 -0.476883

In [276]:
data

a  1    0.725068
   2   -0.990273
   3    0.013685
b  1   -0.473149
   2   -2.089740
   3    0.488818
c  1   -0.473395
   2    1.517124
d  2    0.877102
   3   -0.476883
dtype: float64

In [277]:
data.unstack().stack()

a  1    0.725068
   2   -0.990273
   3    0.013685
b  1   -0.473149
   2   -2.089740
   3    0.488818
c  1   -0.473395
   2    1.517124
d  2    0.877102
   3   -0.476883
dtype: float64

In [278]:
frame = DataFrame(np.arange(12).reshape(4,3), 
                  index=[['a','a','b','b'], [1, 2, 1, 2]], 
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])                                 
#열, 행 모두 계층적 색인인 경우

In [279]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [280]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [281]:
frame.index.names

FrozenList([None, None])

In [282]:
frame.index.names = ['key1', 'key2']

In [283]:
frame.index.name

In [284]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [285]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]])

In [286]:
frame.columns.names = ['state', 'color']

In [287]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [288]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

계층 순서 바꾸고 정렬하기

In [289]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [290]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [291]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [292]:
frame.sort_index(1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

단계별 요약통계
> level 옵션 : 한축에 대해 합을 구하고 싶은 단계 지정할 수 있는 옵션

In [293]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [294]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [295]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

DataFrame의 컬럼 사용하기

In [296]:
frame = DataFrame({'a':range(7), 'b':range(7, 0, -1), 
                   'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                   'd' : [0, 1, 2, 0, 1, 2, 3]})

In [297]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [298]:
# 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame 생성
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [299]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [300]:
# 명시적으로 컬럼 남겨두기
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [301]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [302]:
#계층적 색인 단계를 칼럼으로 이동
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1